gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
      // Afficher temporairement l'état du filtre
      display.clear();
      if (newFilterState == 255) {
        display.showNumberDec(9999); // Afficher "9999" pour indiquer FILTRE ON
      } else {
        display.showNumberDec(0);    // Afficher "0000" pour indiquer FILTRE OFF
      }
      
      Serial.print("Filtre: ");
      Serial.println((newFilterState == 255) ? "ON" : "OFF");
      
      // Attendre 500ms puis revenir à l'affichage unifié
      delay(500);
      displayUnified();
    }
    
    encoderButtonPressed = true;
    lastEncoderButtonPress = millis();
  }
  
  if (!encoderButtonState) {
    encoderButtonPressed = false;
  }
}

// Fonction pour afficher la transposition et le preset de manière unifiée
void displayUnified() {
  uint8_t segments[4] = {0, 0, 0, 0};
  
  if (webPresetMode) {
    // En mode webpreset : afficher octave + "P" + numéro preset
    // Format: OOPP où OO = octave (-12 à +12) et PP = "P" + numéro (P1-P8)
    
    // Calcul pour les digits de l'octave (positions 0 et 1)
    if (webOctave == 0) {
      // Octave = 0 : afficher "00"
      segments[0] = display.encodeDigit(0);
      segments[1] = display.encodeDigit(0);
    } else if (webOctave > 0) {
      // Octave positive : afficher directement le nombre
      if (webOctave >= 10) {
        segments[0] = display.encodeDigit(webOctave / 10);
        segments[1] = display.encodeDigit(webOctave % 10);
      } else {
        segments[0] = display.encodeDigit(0);
        segments[1] = display.encodeDigit(webOctave);
      }
    } else {
      // Octave négative : afficher "-" + valeur absolue
      segments[0] = 0x40; // Segment "-"
      int absValue = -webOctave;
      if (absValue >= 10) {
        segments[1] = display.encodeDigit(absValue / 10);
      } else {
        segments[1] = display.encodeDigit(absValue);
      }
    }
    
    // Positions 2 et 3 : "P" + numéro du webpreset
    segments[2] = 0x73; // Segment pour "P"
    segments[3] = display.encodeDigit(selectedWebPreset);
    
  } else {
    // Ancien mode : transposition + preset
    // Format: TTPP où TT = transposition (-12 à +12) et PP = preset (0-9)
    
    // Calcul pour les digits de la transposition (positions 0 et 1)
    if (transpose == 0) {
      segments[0] = display.encodeDigit(0);
      segments[1] = display.encodeDigit(0);
    } else if (transpose > 0) {
      if (transpose >= 10) {
        segments[0] = display.encodeDigit(transpose / 10);
        segments[1] = display.encodeDigit(transpose % 10);
      } else {
        segments[0] = display.encodeDigit(0);
        segments[1] = display.encodeDigit(transpose);
      }
    } else {
      segments[0] = 0x40; // Segment "-"
      int absValue = -transpose;
      if (absValue >= 10) {
        segments[1] = display.encodeDigit(absValue / 10);
      } else {
        segments[1] = display.encodeDigit(absValue);
      }
    }
    
    // Calcul pour les digits du preset (positions 2 et 3)
    segments[2] = display.encodeDigit(0);
    segments[3] = display.encodeDigit(selectedPreset);
  }
  
  // Afficher les segments
  display.setSegments(segments);
}

// Fonction pour mettre à jour l'afficheur TM1637
void updateDisplay() {
  if (millis() - lastDisplayUpdate >= DISPLAY_UPDATE_INTERVAL) {
    // Utiliser la nouvelle fonction d'affichage unifiée
    displayUnified();
    lastDisplayUpdate = millis();
  }
}

void setup()
{
  Serial.begin(115200);
  Serial.println("=== Contrôleur Interactif ESP32 ===");
  Serial.println("Initialisation...");
  
  // Désactiver le Bluetooth pour améliorer la stabilité des lectures analogiques
  btStop();
  Serial.println("Bluetooth désactivé pour optimiser les lectures ADC");
  
  // Afficher l'adresse MAC de l'ESP32
  Serial.print("Adresse MAC ESP32: ");
  Serial.println(WiFi.macAddress());
  
  // Initialisation du tableau DMX à 0
  for (int i = 0; i < 512; i++) {
    dmxValues[i] = 0;
  }
  
  // Initialisation des paramètres
  initializeParameters();
  
  // Initialisation des presets
  initializePresets();
  
  // En mode webpreset, on ne charge plus les anciens presets
  if (webPresetMode) {
    // Démarrer en mode web avec P1 sélectionné
    selectedPreset = 0; // Preset 0 = mode web
    webModeActive = true;
    selectedWebPreset = 1;
    
    // Charger le premier webpreset s'il existe
    if (webPresetCount > 0 && strlen(webPresets[0].name) > 0) {
      loadWebPresetFromEncoder(1);
    }
  } else {
    // Ancien comportement (chargement preset 1)
    loadPreset(1);
    selectedPreset = 1;
  }
  
  // Initialisation de l'interface utilisateur
  initializeUserInterface();
  
  // Affichage initial
  displayUnified();
  
  // Configuration ESP-NOW
  WiFi.mode(WIFI_STA);
  
  if (esp_now_init() != ESP_OK) {
    Serial.println("Erreur d'initialisation ESP-NOW");
    return;
  }
  
  esp_now_register_send_cb(OnDataSent);

  
  // Configuration du peer récepteur ESP8266 (unicast au lieu de broadcast)
  memcpy(peerInfo.peer_addr, receiverAddress, 6);
  peerInfo.channel = 0;
  peerInfo.encrypt = false;
  
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {
    Serial.println("Erreur d'ajout du peer");
    return;
  }
  

  
  Serial.println("ESP-NOW initialisé");
  Serial.println("Mode: Unicast vers récepteur ESP8266");
  Serial.print("Adresse MAC cible: ");
  for (int i = 0; i < 6; i++) {
    Serial.print(receiverAddress[i], HEX);
    if (i < 5) Serial.print(":");
  }
  Serial.println();
  
  // Initialisation de l'interface web
  setupWebInterface();
  

  Serial.println("Fréquence d'émission: " + String(EMISSION_FREQUENCY) + "Hz");
  Serial.println("Capteurs Sharp IR sur GPIO35 et GPIO36");
  Serial.println("Faders sur GPIO32, GPIO33, GPIO34");
  Serial.println("Encodeur KY-040 sur GPIO26, GPIO27, GPIO25");
  Serial.println("Afficheur TM1637 sur GPIO18, GPIO19");
  Serial.println("  Format d'affichage: TTPP (TT=transposition, PP=preset)");
  Serial.println("  Exemples: 0501=transpose +5/preset 1, -203=transpose -2/preset 3");
  Serial.println("Boutons push sur GPIO21, GPIO22, GPIO23");
  Serial.println("Bouton 1: Décrémenter transposition (-12 à +12)");
  Serial.println("Bouton 2: Incrémenter transposition (-12 à +12)");
  Serial.println("Bouton 3: Trig HH");
  Serial.println("Bouton encodeur: Toggle filtre ON/OFF");

