gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
// API: Charger un preset web
void handleLoadWebPreset() {
  if (webServer.hasArg("plain")) {
    DynamicJsonDocument doc(512);
    deserializeJson(doc, webServer.arg("plain"));
    
    int id = doc["id"];
    
    // Vérifier que le slot existe et contient des données
    if (id >= 0 && id < MAX_WEB_PRESETS && id < webPresetCount && strlen(webPresets[id].name) > 0) {
      // Appliquer les valeurs du preset
      for (int i = 0; i < 27; i++) {
        parameters[i].value = webPresets[id].values[i];
        dmxValues[parameters[i].dmxChannel - 1] = webPresets[id].values[i];
      }
      
      // Charger l'octave du preset
      webOctave = webPresets[id].octave;
      
      // Charger les assignations physiques du preset
      for (int i = 0; i < 4; i++) {
        webAssignments[i] = webPresets[id].assignments[i];
      }
      
      // Appliquer l'octave aux paramètres sensibles
      applyWebOctave();
      
      // Sauvegarder les assignations web mises à jour
      saveWebAssignments();
      
      // Mettre à jour l'affichage de l'octave
      displayUnified();
      
      // Forcer la mise à jour de l'affichage de l'octave
      if (webOctave >= 0) {
        display.showNumberDec(webOctave, false, 2, 0);
      } else {
        // Pour les valeurs négatives, afficher le signe moins
        uint8_t segments[] = {0x40, 0, 0, 0}; // Segment "-" à la position 0
        display.setSegments(segments);
        delay(100); // Petit délai pour voir le signe moins
        display.showNumberDec(-webOctave, false, 1, 1); // Valeur absolue à partir de la position 1
      }
      
      lastWebPreset = id;
      
      // Sauvegarder l'état dans le preset 0 pour persistance
      saveWebStateToPreset0();
      
      DynamicJsonDocument response(1024);
      response["success"] = true;
      response["message"] = "Preset chargé";
      
      // Retourner les vraies valeurs des presets web (pas des paramètres actuels)
      JsonArray paramsArray = response.createNestedArray("parameters");
      for (int i = 0; i < 27; i++) {
        paramsArray.add(webPresets[id].values[i]);
      }
      
      // Retourner aussi l'octave et les assignations du preset
      response["octave"] = webPresets[id].octave;
      JsonArray assignmentsArray = response.createNestedArray("assignments");
      for (int i = 0; i < 4; i++) {
        assignmentsArray.add(webPresets[id].assignments[i]);
      }
      
      String responseStr;
      serializeJson(response, responseStr);
      webServer.send(200, "application/json", responseStr);
    } else {
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Preset non trouvé ou slot vide\"}");
    }
  } else {
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");
  }
}

// API: Lister les presets web
void handleListWebPresets() {
  DynamicJsonDocument doc(2048);
  JsonArray presetsArray = doc.createNestedArray("presets");
  
  for (int i = 0; i < webPresetCount; i++) {
    JsonObject preset = presetsArray.createNestedObject();
    preset["name"] = webPresets[i].name;
    preset["id"] = i;
    preset["octave"] = webPresets[i].octave;
    
    // Inclure les assignations physiques
    JsonArray assignmentsArray = preset.createNestedArray("assignments");
    for (int j = 0; j < 4; j++) {
      assignmentsArray.add(webPresets[i].assignments[j]);
    }
  }
  
  String response;
  serializeJson(doc, response);
  webServer.send(200, "application/json", response);
}

// API: Gérer les octaves
void handleOctave() {
  if (webServer.hasArg("plain")) {
    DynamicJsonDocument doc(512);
    deserializeJson(doc, webServer.arg("plain"));
    
    String direction = doc["direction"];
    
    if (direction == "up" && webOctave < 12) {
      webOctave++;
    } else if (direction == "down" && webOctave > -12) {
      webOctave--;
    }
    
    // Appliquer l'octave web directement (système séparé)
    applyWebOctave();
    
    // Afficher l'octave sur l'écran (utiliser webOctave au lieu de transpose)
    if (selectedPreset == 0 && webModeActive) {
      displayUnified();
      
      // Forcer la mise à jour de l'affichage
      if (webOctave >= 0) {
        display.showNumberDec(webOctave, false, 2, 0);
      } else {
        // Pour les valeurs négatives, afficher le signe moins
        uint8_t segments[] = {0x40, 0, 0, 0}; // Segment "-" à la position 0
        display.setSegments(segments);
        delay(100); // Petit délai pour voir le signe moins
        display.showNumberDec(-webOctave, false, 1, 1); // Valeur absolue à partir de la position 1
      }
      
      Serial.print("🎵 Octave web mise à jour: ");
      Serial.println(webOctave);
    }
    
    DynamicJsonDocument response(256);
    response["success"] = true;
    response["octave"] = webOctave;
    response["message"] = "Octave mise à jour";
    
    String responseStr;
    serializeJson(response, responseStr);
    webServer.send(200, "application/json", responseStr);
  } else {
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");
  }
}

// Gestion des erreurs 404
void handleNotFound() {
  String path = webServer.uri();
  Serial.print("❌ 404 - Page non trouvée: ");
  Serial.println(path);
  
  // Vérifier si le fichier existe dans LittleFS
  if (LittleFS.exists(path)) {
    Serial.println("  ⚠️  Le fichier existe dans LittleFS mais n'a pas pu être servi");
  } else {
    Serial.println("  ❌ Le fichier n'existe pas dans LittleFS");
  }
  
  String response = "Page non trouvée: " + path;
  response += "\n\nFichiers disponibles:\n";
  
  // Lister les fichiers disponibles
  File root = LittleFS.open("/");
  File file = root.openNextFile();
  while (file) {
    response += "- " + String(file.name()) + "\n";
    file = root.openNextFile();
  }
  
  webServer.send(404, "text/plain", response);
}




// Sauvegarde des presets web dans LittleFS
void saveWebPresets() {
  File file = LittleFS.open("/web_presets.json", "w");
  if (file) {
    DynamicJsonDocument doc(2048); // Réduction de 4096 à 2048
    JsonArray presetsArray = doc.createNestedArray("presets");
    
    for (int i = 0; i < MAX_WEB_PRESETS; i++) {
      // Sauvegarder seulement les slots qui contiennent des données
      if (strlen(webPresets[i].name) > 0) {
        JsonObject preset = presetsArray.createNestedObject();
        preset["slot"] = i;  // Sauvegarder le numéro de slot
        preset["name"] = webPresets[i].name;
        preset["octave"] = webPresets[i].octave; // Sauvegarder l'octave
        
        // Sauvegarder les assignations physiques
        JsonArray assignmentsArray = preset.createNestedArray("assignments");
        for (int j = 0; j < 4; j++) {
          assignmentsArray.add(webPresets[i].assignments[j]);
        }
        
